import {
  ITestPath
} from '../types';

/**
 * 凹多边形（形如车头）
 *
 *   0  1  2  3  4  5
 * 0 ⦿→ +--+--+--◉--+-
 * 1 ↑           ↓
 * 2 ◉--- ←◉     |
 * 3 |     ↑     |
 * 4 |     ◉--- ←◉
 * 5 |
 */
export const TEST_PATH_6_CONCAVE: ITestPath = {
  path: [[0, 0], [4, 0], [4, 4], [2, 4], [2, 2], [0, 2]],
  perimeter: 16,
  area: 12,
  midpoints: [[2, 0], [4, 2], [3, 4], [2, 3], [1, 2], [0, 1]],
  segments: [[[0, 0], [4, 0]], [[4, 0], [4, 4]], [[4, 4], [2, 4]], [[2, 4], [2, 2]], [[2, 2], [0, 2]], [[0, 2], [0, 0]]],
  centroid: null, // TODO
  bbox: [[0, 0], [4, 4]],
  ecp: {
    t: [0, 0],
    r: [4, 0],
    b: [4, 4],
    l: [0, 0],
    c: [2, 2]
  },
  intersection: [],
  slice: []
};